# **ACL Seadistamise √ïpetus** üêµ

## **1. MIS on ACL?**
Access Control List = **Liikluse filter** (nagu tulem√º√ºr)
- Kontrollib, mis liiklus **TOHIB** v√µi **EI TOHI** l√§bi minna
- T√∂√∂tab nagu nimekiri reegleid √ºlalt alla

## **2. ACL T√º√ºbid:**
```
Standard ACL (1-99): Vaatab AINULT source IP
Extended ACL (100-199): Vaatab source + destination + ports
```

## **3. KUIDAS ACL-i KIRJUTADA:**

### **Samm 1: Kirjuta ACL reegel**
```cisco
access-list [number] [permit/deny] [protocol] [source] [wildcard] [dest] [wildcard] [port]

! N√ÑIDE - Luba kontori v√µrgust Google DNS-ile:
access-list 100 permit ip 192.168.1.0 0.0.0.255 host 8.8.8.8
         ‚Üë       ‚Üë      ‚Üë     ‚Üë        ‚Üë         ‚Üë
      number  action protocol source wildcard destination
```

### **Samm 2: Rakenda ACL interface'ile**
```cisco
interface g0/0.10              ! Mine √µigele interface'ile
 ip access-group 100 in        ! Rakenda ACL 100 sissetulevale liiklusele
                    ‚Üë  ‚Üë
                ACL number  suund

! SUUND:
! in = liiklus mis TULEB SISSE ruuterisse
! out = liiklus mis L√ÑHEB V√ÑLJA ruuterist
```

## **4. WILDCARD MASK - Kuidas arvutada?**

**LIHTNE REEGEL: Tee subnet mask "tagurpidi"!**

```
Subnet Mask ‚Üí Wildcard Mask
255.255.255.0 ‚Üí 0.0.0.255     (0 ‚Üî 255)
255.255.255.128 ‚Üí 0.0.0.127   (128 ‚Üí 127)
255.255.255.192 ‚Üí 0.0.0.63    (192 ‚Üí 63)
255.255.255.224 ‚Üí 0.0.0.31    (224 ‚Üí 31)
255.255.255.240 ‚Üí 0.0.0.15    (240 ‚Üí 15)
255.255.255.248 ‚Üí 0.0.0.7     (248 ‚Üí 7)

VALEM: Wildcard = 255 - subnet_octet
N√§ide: 255 - 224 = 31
```

## **5. T√ÑIELIK N√ÑIDE - Kontori K√ºlaliste WiFi:**

### **√úlesanne:** K√ºlalised tohivad ainult internetti, mitte firma v√µrku

```cisco
! STEP 1: Kirjuta ACL reeglid
Router(config)# access-list 100 remark === VISITOR WIFI ===
Router(config)# access-list 100 permit ip 192.168.50.0 0.0.0.255 host 8.8.8.8
Router(config)# access-list 100 permit ip 192.168.50.0 0.0.0.255 host 1.1.1.1
Router(config)# access-list 100 deny ip 192.168.50.0 0.0.0.255 192.168.0.0 0.0.255.255
Router(config)# access-list 100 permit ip 192.168.50.0 0.0.0.255 any

! Mida see teeb:
! Rida 1: Luba K√ºlalised ‚Üí Google DNS
! Rida 2: Luba K√ºlalised ‚Üí Cloudflare DNS  
! Rida 3: Keela K√ºlalised ‚Üí K√µik 192.168.x.x v√µrgud
! Rida 4: Luba K√ºlalised ‚Üí K√µik muu (internet)

! STEP 2: Rakenda K√ºlaliste VLAN interface'ile
Router(config)# interface g0/1.50
Router(config-subif)# ip access-group 100 in
```

## **6. VTY ACL (SSH/Telnet jaoks):**

```cisco
! Luba ainult IT osakond SSH-ida
Router(config)# access-list 102 permit ip 172.16.10.0 0.0.0.255 any
Router(config)# access-list 102 deny ip any any    ! Tegelikult pole vaja, implicit deny

! Rakenda VTY ridadele (MITTE interface'ile!)
Router(config)# line vty 0 4
Router(config-line)# access-class 102 in    ! NB! access-CLASS, mitte access-group!
Router(config-line)# password cisco
Router(config-line)# login
```

## **7. SERVER KAITSE N√ÑIDE:**

```cisco
! Ainult IT ja Arendajad saavad serveritesse
access-list 101 remark === SERVER PROTECTION ===
access-list 101 permit ip 172.16.10.0 0.0.0.31 172.16.100.0 0.0.0.15  ! IT ‚Üí Servers
access-list 101 permit tcp 172.16.20.0 0.0.0.63 172.16.100.0 0.0.0.15 eq 80  ! Dev ‚Üí Web
access-list 101 permit tcp 172.16.20.0 0.0.0.63 172.16.100.0 0.0.0.15 eq 443 ! Dev ‚Üí HTTPS
access-list 101 deny ip any 172.16.100.0 0.0.0.15  ! Keela k√µik muu serveritesse
access-list 101 permit ip any any  ! Luba muu liiklus

! Rakenda serveri interface'ile
interface g0/0.100
 ip access-group 101 in
```

## **8. KUIDAS KONTROLLIDA:**

```cisco
! Vaata ACL-i ja kas keegi on seda kasutanud
Router# show access-lists
Extended IP access list 100
    10 permit ip 192.168.50.0 0.0.0.255 host 8.8.8.8 (15 matches)  ‚Üê 15 paketti l√§ks l√§bi!
    20 deny ip 192.168.50.0 0.0.0.255 192.168.0.0 0.0.255.255 (3 matches) ‚Üê 3 blokeeritud!

! Vaata mis on kus rakendatud
Router# show ip interface g0/1.50 | include access
  Inbound access list is 100
```

## **9. SAGEDASED VEAD:** ‚ùå

```cisco
! VIGA 1: Vale suund
interface g0/0.50
 ip access-group 100 out    ! ‚Üê VALE! Liiklus tuleb SISSE, mitte v√§lja

! VIGA 2: Vale wildcard
access-list 100 deny ip 192.168.1.0 255.255.255.0 any   ! ‚Üê VALE! See on subnet mask!
access-list 100 deny ip 192.168.1.0 0.0.0.255 any       ! ‚Üê √ïIGE! Wildcard mask

! VIGA 3: ACL pole rakendatud
! Kirjutasid ACL √§ra, aga unustasid interface'ile panna!

! VIGA 4: Vale ACL number VTY jaoks
line vty 0 4
 ip access-group 102 in    ! ‚Üê VALE! VTY kasutab access-CLASS
 access-class 102 in       ! ‚Üê √ïIGE!
```

## **KOKKUV√ïTE - 3 SAMMU:**
1. **KIRJUTA** ACL (access-list 100 ...)
2. **RAKENDA** interface'ile (ip access-group 100 in) v√µi VTY-le (access-class)
3. **KONTROLLI** (show access-lists)

**MEELDETULETUS:** 
- ACL t√∂√∂tab √ºlalt alla - esimene vaste v√µidab!
- L√µpus on alati n√§htamatu "deny all"
- **SINU laboris kasuta OMA arvutatud 10.x.x.x IP-sid!** ü¶ç
